tsung_files/deletesolr_simplesearch/simple_search.xml
<?xml version="1.0"?><tsung loglevel="debug" version="1.0">

  <clients>
    <client host="localhost" use_controller_vm="true"/>
  </clients>
  
  <servers>
  <server host="52.91.28.98" port="8000" type="tcp"/>
</servers>

  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="1.5" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="4" duration="30" unit="second">
      <users arrivalrate="4" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="5" duration="30" unit="second">
      <users arrivalrate="6" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="6" duration="30" unit="second">
      <users arrivalrate="10" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="7" duration="30" unit="second">
      <users arrivalrate="25" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="8" duration="30" unit="second">
      <users arrivalrate="50" unit="second"/>
    </arrivalphase>
  </load>

  <options>
   <option type="ts_http" name="user_agent">
    <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
    <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
   </option>
    <option name="file_server" id="search_words" value="./search_words.csv"/>
  </options>

   <sessions>
      <session name="login_search_logout" probability="100" type="ts_http">
      
      <request><http url="http://52.91.28.98/" version="1.1" method="GET"/></request>
      
      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="num"/>
      </setdynvars>
      
      <request>
        <dyn_variable name="authenticity_token"/> 
        <http url="/login" version="1.1" method="GET"/>
      </request>

      <setdynvars sourcetype="file" fileid="search_words" delimiter=";" order="random">
        <var name="random_search_keyword"/>
      </setdynvars>
      
      
      <request subst="true">
        <http url="http://52.91.28.98/login" version="1.1" contents="utf8=%E2%9C%93&amp;authenticity_token=%%_authenticity_token%%&amp;session%5Bemail%5D=user%%_num%%%40gmail.com&amp;session%5Bpassword%5D=123456&amp;commit=Log+in" content_type="application/x-www-form-urlencoded" method="POST">
        </http>
      </request>

      <request subst="true">
        <http url="/products?utf8=%E2%9C%93&amp;search=%%_random_search_keyword%%" version="1.1" method="GET"/>
      </request>
    </session>
	</sessions>
</tsung>